Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.3.53/Microchip.SAME53_DFP.pdsc
      <condition id="ATSAME53J18A">
         <require Dvendor="Microchip:3" Dname="ATSAME53J18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAME53J19A">
         <description>Headers and startup code for Microchip ATSAME53J19A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same53j19a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same53j19a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same53j19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same53j19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same53j19a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same53j19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same53j19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same53j19a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same53j19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same53j19a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAME53N19A">
         <description>Headers and startup code for Microchip ATSAME53N19A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same53n19a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same53n19a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same53n19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same53n19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same53n19a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same53n19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same53n19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same53n19a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same53n19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same53n19a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAME53J20A">
         <description>Headers and startup code for Microchip ATSAME53J20A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same53j20a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same53j20a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same53j20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same53j20a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same53j20a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same53j20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same53j20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same53j20a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same53j20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same53j20a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAME53N20A">
         <description>Headers and startup code for Microchip ATSAME53N20A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same53n20a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same53n20a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same53n20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same53n20a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same53n20a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same53n20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same53n20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same53n20a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same53n20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same53n20a_sram.icf" attr="config"/>
         </files>
      </component>
