Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.3.53/Microchip.SAME53_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAME53J18A">
         <description>Headers and startup code for Microchip ATSAME53J18A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same53j18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same53j18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same53j18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same53j18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same53j18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same53j18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same53j18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same53j18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same53j18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same53j18a_sram.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
